/*
## 問題 11.6 💻📄
与えられた文字列がメールアドレスであるかチェックする関数`isEmailAddress`を実装しなさい。ただしRFC5322に準拠したメールアドレスの判定は難しいので、与えられたテストコードが通ればよいものとする。
**出題範囲**: 11.3
*/

export function isEmailAddress(input){
    if ( typeof input !== 'string'){        // 文字列かどうか。null、undefinedもここで除外
        return false;
    }
//  const pattern = /^(?=.{1,64}@)[a-zA-Z0-9!#$%&'*+\-/=?^_`{|}~]+(?:\.[a-zA-Z0-9!#$%&'*+\-/=?^_`{|}~]+)*@[a-zA-Z0-9-]+(?:\.[a-zA-Z0-9-]{1,250}){0,1}$/;
//  const pattern = /^(?=.{1,64}@)[a-zA-Z0-9!#$%&'*+\-/=?^_`{|}~]+(?:\.[a-zA-Z0-9!#$%&'*+\-/=?^_`{|}~]+)*@[a-zA-Z0-9-]+(?:\.[a-zA-Z0-9-]{1,253}\#)?$/;
    const pattern = /^(?=.{1,64}@)[a-zA-Z0-9!#$%&'*+\-/=?^_`{|}~]+(?:\.[a-zA-Z0-9!#$%&'*+\-/=?^_`{|}~]+)*@[a-zA-Z0-9-]+(?:\.[a-zA-Z0-9-]{1,253})?$/;
    
    return pattern.test(input);
}

console.log(isEmailAddress(".foo@example.com"));
console.log(isEmailAddress("a@0000012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901"));
console.log(isEmailAddress("foo@!#$%&'*+-/=?^_`.{|}~"));
console.log(isEmailAddress("foo@example.com#"));

